package com.github.pdaodao.springwebplus.ai;

import com.hankcs.hanlp.HanLP;

import java.util.List;

public class NlpMain {
    public static void main(String[] args) {
        final String text = "5.1.1 统一用户组件（底座）\n" +
                "统一用户系统主要包括用户管理、身份认证、统一授权、账号管 理、数据同步和安全监控等模块，这些模块相互协作，为系统提供全 面的用户管理和安全保障功能。\n" +
                "\n" +
                "5.1.1.1 用户管理模块\n" +
                "用户管理模块是统一用户系统的核心，主要用于管理用户的基本 信息和权限。该模块提供了用户注册、登录、退出登录、密码找回、 身份认证等功能，使得用户可以方便地访问和使用系统。 同时，该模 块还可以实现用户权限管理，即管理员可以为不同的用户或用户组设 置不同的权限，以保障系统的安全性。\n" +
                " 用户注册：支持用户在系统中自主注册账号，并提供邮箱验证、短 信验证等方式确保注册信息的真实性。\n" +
                " 用户登录：支持用户使用注册账号和密码进行登录，并提供密码找 回等功能。\n" +
                " 退出登录：支持用户退出登录状态，同时销毁相关的登录信息和凭 证。\n" +
                " 重置密码：支持用户通过邮箱或手机验证来重置密码，提高账户的 安全性。\n" +
                " 身份认证：支持用户使用多种方式进行身份验证，例如常规的账号 密码方式，或是使用指纹识别、人脸识别等生物特征认证方式。\n" +
                " 权限管理：支持管理员在系统中配置和管理用户的权限，从而确保 不同用户可以访问到自 己具备权限的资源。\n" +
                "\n" +
                "5.1.1.2 身份认证模块\n" +
                "身份认证模块用于验证用户身份的合法性，以确保系统的安全性。 该模块提供了多种常见的身份验证方式，例如密码验证、验证码验证、 单点登录、OAuth 等。通过身份认证模块，可以有效地防止非法用户 的访问和攻击，提升系统的安全性。\n" +
                " 密码验证：支持用户使用账号密码进行登录，并对密码进行加密存 储， 以确保密码的安全性。\n" +
                " 验证码验证：支持使用图形验证码、短信验证码等方式对用户进行 身份验证， 以避免机器人攻击和非法登录。\n" +
                " 单点登录：支持多个系统之间的单点登录，使得用户可以通过一次 登录即可访问多个系统。\n" +
                " OAuth 认证：支持使用 OAuth 认证协议进行身份验证，允许第三方 应用使用授权码或令牌进行访问。\n" +
                "\n" +
                "5.1.1.3 统一授权模块\n" +
                "统一授权模块是用于统一授权管理的模块，主要用于管理用户对 系统资源的访问权限。通过该模块，管理员可以对不同的用户或用户 组设置不同的权限， 以确保系统的安全性。 同时，该模块还能够实现 对权限的细粒度控制，使得用户可以访问到自 己所需的资源，提高系 统的可用性和用户体验。\n" +
                " 权限管理：支持管理员对不同用户和用户组的访问权限进行配置和 管理。\n" +
                " 访问控制：支持对资源进行访问控制，包括角色控制、访问控制列 表（ACL）等方式，确保只有具备访问权限的用户可以访问。\n" +
                " 审计管理：支持对用户访问行为进行审计，以便管理员可以随时监 控和了解用户的访问行为。\n" +
                "\n" +
                "\n" +
                "5.1.1.4 统一账号管理模块\n" +
                "统一账号管理模块用于实现不同系统之间的账号互通，使得用户 可以通过同一个账号访问不同的系统。该模块可以将用户在不同系统 中的账号进行关联，从而提高用户体验和系统的安全性。 同时，该模 块还可以实现用户账号的单点登录功能，使得用户可以在不同系统中 无需重复登录。\n" +
                " 账号注册模块：账号注册模块用于用户在系统中注册账号，通常需 要用户提供一些基本信息，例如用户名、密码、邮箱地址、手机号\n" +
                "\n" +
                "码等等。在注册成功后，系统会为该用户创建一个唯一的账号，用 于后续的登录和访问。\n" +
                "账号关联模块：账号关联模块用于将不同系统中的账号进行关联， 从而实现账号的互通。例如，如果用户在系统 A 中注册了一个账号， 在系统 B 中又使用同样的用户名或者邮箱地址进行了注册，那么账 号关联模块就可以将这两个账号关联起来，使得用户可以通过同一 个账号访问这两个系统。\n" +
                "账号绑定模块：账号绑定模块用于将用户在第三方平台上的账号与 系统中的账号进行绑定，例如将微信账号、QQ 账号、微博账号等与 系统中的账号进行绑定。这样，用户就可以通过第三方平台上的账 号登录系统，提高用户的使用便捷性和用户体验。\n" +
                "单点登录模块：单点登录模块用于实现用户在不同系统中的单点登 录，即用户只需在其中一个系统中进行登录，就可以在其他系统中 免登录访问。";
        final List<String> list =  HanLP.extractSummary(text, 1);
        for(final String t: list){
            System.out.println(t);
        }
    }
}
